# PySpark Handelling Missing Values
* Dropping columns
* Dropping Rows
* Various parameters in dropping functionalities
* Handelling missing values by mean, median & mode

In [1]:
# Liabraries import
import pandas as pd
import pyspark

In [2]:
# Create a PySpark session
from pyspark.sql import SparkSession
SparkSession = SparkSession.builder.appName('Practice').getOrCreate()
SparkSession

In [3]:
# read data (pyspark)
data_path = "C:\Personal\Carrier Path\Data_Scientist\Advanced Phase\PySpark/"
data = SparkSession.read.csv(data_path + 'Data_2.csv', inferSchema = True , header = True)
data.show()

+----------+----+----------+------+
|      Name| age|Experience|Salary|
+----------+----+----------+------+
|     Krish|  31|        10| 30000|
|Sudhanshu |  30|         8| 25000|
|     Sunny|  29|         4| 20000|
|     Parul|  24|         3| 20000|
|    Harsha|  21|         1| 15000|
|   Shubham|  23|         2| 18000|
|    Mahesh|NULL|      NULL| 40000|
|      NULL|  34|        10| 38000|
|      NULL|  36|      NULL|  NULL|
+----------+----+----------+------+

In [4]:
# read data pandas
data_pandas = pd.read_csv(data_path + 'Data_2.csv')
data_pandas

         Name   age  Experience   Salary
0       Krish  31.0        10.0  30000.0
1  Sudhanshu   30.0         8.0  25000.0
2       Sunny  29.0         4.0  20000.0
3       Parul  24.0         3.0  20000.0
4      Harsha  21.0         1.0  15000.0
5     Shubham  23.0         2.0  18000.0
6      Mahesh   NaN         NaN  40000.0
7         NaN  34.0        10.0  38000.0
8         NaN  36.0         NaN      NaN

### Drop the columns

In [5]:
# pyspark 
data.drop('Name')

DataFrame[age: int, Experience: int, Salary: int]

In [6]:
# pandas
data_pandas.drop('Name', axis = 1)

    age  Experience   Salary
0  31.0        10.0  30000.0
1  30.0         8.0  25000.0
2  29.0         4.0  20000.0
3  24.0         3.0  20000.0
4  21.0         1.0  15000.0
5  23.0         2.0  18000.0
6   NaN         NaN  40000.0
7  34.0        10.0  38000.0
8  36.0         NaN      NaN

### Drop rows including the null values

In [7]:
# PySpark - Option 1
data.dropna().show()

+----------+---+----------+------+
|      Name|age|Experience|Salary|
+----------+---+----------+------+
|     Krish| 31|        10| 30000|
|Sudhanshu | 30|         8| 25000|
|     Sunny| 29|         4| 20000|
|     Parul| 24|         3| 20000|
|    Harsha| 21|         1| 15000|
|   Shubham| 23|         2| 18000|
+----------+---+----------+------+

In [8]:
# PySpark - Option 2
data.na.drop().show()

+----------+---+----------+------+
|      Name|age|Experience|Salary|
+----------+---+----------+------+
|     Krish| 31|        10| 30000|
|Sudhanshu | 30|         8| 25000|
|     Sunny| 29|         4| 20000|
|     Parul| 24|         3| 20000|
|    Harsha| 21|         1| 15000|
|   Shubham| 23|         2| 18000|
+----------+---+----------+------+

* Basically 'drop.na' provides us some functionalities to drop rows in a specific way

In [9]:
# Pyspark - Parameter under drop() - 'how'
data.na.drop(how = 'any').show()

# dropped all rows which includes atleast one NA value

+----------+---+----------+------+
|      Name|age|Experience|Salary|
+----------+---+----------+------+
|     Krish| 31|        10| 30000|
|Sudhanshu | 30|         8| 25000|
|     Sunny| 29|         4| 20000|
|     Parul| 24|         3| 20000|
|    Harsha| 21|         1| 15000|
|   Shubham| 23|         2| 18000|
+----------+---+----------+------+

In [10]:
# Pyspark - Parameter under drop() - 'how'
data.na.drop(how = 'all').show()

# Drop rows which includes all the null values

+----------+----+----------+------+
|      Name| age|Experience|Salary|
+----------+----+----------+------+
|     Krish|  31|        10| 30000|
|Sudhanshu |  30|         8| 25000|
|     Sunny|  29|         4| 20000|
|     Parul|  24|         3| 20000|
|    Harsha|  21|         1| 15000|
|   Shubham|  23|         2| 18000|
|    Mahesh|NULL|      NULL| 40000|
|      NULL|  34|        10| 38000|
|      NULL|  36|      NULL|  NULL|
+----------+----+----------+------+

In [11]:
# Pyspark - Parameter under drop() - 'thresh'
data.na.drop(how = 'any', thresh = 2).show()

# drop rows which have <2 non null values 
# This thresh overwrites the 'how' parameter

+----------+----+----------+------+
|      Name| age|Experience|Salary|
+----------+----+----------+------+
|     Krish|  31|        10| 30000|
|Sudhanshu |  30|         8| 25000|
|     Sunny|  29|         4| 20000|
|     Parul|  24|         3| 20000|
|    Harsha|  21|         1| 15000|
|   Shubham|  23|         2| 18000|
|    Mahesh|NULL|      NULL| 40000|
|      NULL|  34|        10| 38000|
+----------+----+----------+------+

In [12]:
# Pyspark - Parameter under drop() - 'subset'
data.na.drop(subset = ['Name']).show()

# Under subset we provide variables for which we need to implement the null value treatment
# All those rows are dropped for which we have null values in the variable 'Name'

+----------+----+----------+------+
|      Name| age|Experience|Salary|
+----------+----+----------+------+
|     Krish|  31|        10| 30000|
|Sudhanshu |  30|         8| 25000|
|     Sunny|  29|         4| 20000|
|     Parul|  24|         3| 20000|
|    Harsha|  21|         1| 15000|
|   Shubham|  23|         2| 18000|
|    Mahesh|NULL|      NULL| 40000|
+----------+----+----------+------+

In [ ]:
# Pandas
data_pandas.dropna()

### Fill the missing value

In [13]:
data.na.fill(value = 2).show()

# missing value in all the numerical data type variable is replaced with 2

+----------+---+----------+------+
|      Name|age|Experience|Salary|
+----------+---+----------+------+
|     Krish| 31|        10| 30000|
|Sudhanshu | 30|         8| 25000|
|     Sunny| 29|         4| 20000|
|     Parul| 24|         3| 20000|
|    Harsha| 21|         1| 15000|
|   Shubham| 23|         2| 18000|
|    Mahesh|  2|         2| 40000|
|      NULL| 34|        10| 38000|
|      NULL| 36|         2|     2|
+----------+---+----------+------+

In [14]:
data.na.fill(value = 'abc').show()

# missing value in all the text data type variable is replaced with 'abc'

+----------+----+----------+------+
|      Name| age|Experience|Salary|
+----------+----+----------+------+
|     Krish|  31|        10| 30000|
|Sudhanshu |  30|         8| 25000|
|     Sunny|  29|         4| 20000|
|     Parul|  24|         3| 20000|
|    Harsha|  21|         1| 15000|
|   Shubham|  23|         2| 18000|
|    Mahesh|NULL|      NULL| 40000|
|       abc|  34|        10| 38000|
|       abc|  36|      NULL|  NULL|
+----------+----+----------+------+

In [15]:
data.na.fill(value = 15 , subset = ['Experience']).show()

# missing value in the variable 'Experience' is replaced with '15'

+----------+----+----------+------+
|      Name| age|Experience|Salary|
+----------+----+----------+------+
|     Krish|  31|        10| 30000|
|Sudhanshu |  30|         8| 25000|
|     Sunny|  29|         4| 20000|
|     Parul|  24|         3| 20000|
|    Harsha|  21|         1| 15000|
|   Shubham|  23|         2| 18000|
|    Mahesh|NULL|        15| 40000|
|      NULL|  34|        10| 38000|
|      NULL|  36|        15|  NULL|
+----------+----+----------+------+

**Imputing the null values with the mean. median or mode**

In [16]:
from pyspark.ml.feature import Imputer

imputer = Imputer(inputCols=['age', 'Experience','Salary'],
                  outputCols= ["{}_imputed".format(c) for c in ['age', 'Experience','Salary']]
                 ).setStrategy('mean')

In [19]:
imputer.fit(data).transform(data).show()

+----------+----+----------+------+-----------+------------------+--------------+
|      Name| age|Experience|Salary|age_imputed|Experience_imputed|Salary_imputed|
+----------+----+----------+------+-----------+------------------+--------------+
|     Krish|  31|        10| 30000|         31|                10|         30000|
|Sudhanshu |  30|         8| 25000|         30|                 8|         25000|
|     Sunny|  29|         4| 20000|         29|                 4|         20000|
|     Parul|  24|         3| 20000|         24|                 3|         20000|
|    Harsha|  21|         1| 15000|         21|                 1|         15000|
|   Shubham|  23|         2| 18000|         23|                 2|         18000|
|    Mahesh|NULL|      NULL| 40000|         28|                 5|         40000|
|      NULL|  34|        10| 38000|         34|                10|         38000|
|      NULL|  36|      NULL|  NULL|         36|                 5|         25750|
+----------+----+----------+------+-----------+------------------+--------------+

In [20]:
imputer = Imputer(inputCols=['age', 'Experience','Salary'],
                  outputCols= ["{}_imputed".format(c) for c in ['age', 'Experience','Salary']]
                 ).setStrategy('median')

In [21]:
imputer.fit(data).transform(data).show()

+----------+----+----------+------+-----------+------------------+--------------+
|      Name| age|Experience|Salary|age_imputed|Experience_imputed|Salary_imputed|
+----------+----+----------+------+-----------+------------------+--------------+
|     Krish|  31|        10| 30000|         31|                10|         30000|
|Sudhanshu |  30|         8| 25000|         30|                 8|         25000|
|     Sunny|  29|         4| 20000|         29|                 4|         20000|
|     Parul|  24|         3| 20000|         24|                 3|         20000|
|    Harsha|  21|         1| 15000|         21|                 1|         15000|
|   Shubham|  23|         2| 18000|         23|                 2|         18000|
|    Mahesh|NULL|      NULL| 40000|         29|                 4|         40000|
|      NULL|  34|        10| 38000|         34|                10|         38000|
|      NULL|  36|      NULL|  NULL|         36|                 4|         20000|
+----------+----+----------+------+-----------+------------------+--------------+

In [22]:
imputer = Imputer(inputCols=['age', 'Experience','Salary'],
                  outputCols= ["{}_imputed".format(c) for c in ['age', 'Experience','Salary']]
                 ).setStrategy('mode')

In [23]:
imputer.fit(data).transform(data).show()

+----------+----+----------+------+-----------+------------------+--------------+
|      Name| age|Experience|Salary|age_imputed|Experience_imputed|Salary_imputed|
+----------+----+----------+------+-----------+------------------+--------------+
|     Krish|  31|        10| 30000|         31|                10|         30000|
|Sudhanshu |  30|         8| 25000|         30|                 8|         25000|
|     Sunny|  29|         4| 20000|         29|                 4|         20000|
|     Parul|  24|         3| 20000|         24|                 3|         20000|
|    Harsha|  21|         1| 15000|         21|                 1|         15000|
|   Shubham|  23|         2| 18000|         23|                 2|         18000|
|    Mahesh|NULL|      NULL| 40000|         21|                10|         40000|
|      NULL|  34|        10| 38000|         34|                10|         38000|
|      NULL|  36|      NULL|  NULL|         36|                10|         20000|
+----------+----+----------+------+-----------+------------------+--------------+